Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/health_related_benefits_and_entitlements/long_term_illness_scheme.html.txt.tmx
Source language: en
Languages: ga

source: People suffering from certain conditions can get free drugs, medicines and medical and surgical appliances for the treatment of that condition
ga: Féadann daoine a fhulaingíonn ó riochtaí áirithe na drugaí, na cógais agus na fearais leighis agus máinliachta um chóireáil an reachta sin a fháil saor in aisce

source: These are provided under the Long Term Illness Scheme
ga: Soláthraítear na drugaí, cógais agus fearais saora seo faoi Scéim na dTinneas Fadtéarmach

source: This scheme is administered by the Health Service Executive (HSE), under Section 59 of the Health Act 1970
ga: Is é Feidhmeannacht na Seirbhíse Sláinte a riarann an scéim seo, faoi Alt 59 den Acht Sláinte 1970

source: The Long Term Illness Scheme does not depend on your income or other circumstances
ga: Cuimhnigh nach mbraitheann Scéim na dTinneas Fadtéarmach ar d’ioncam ná ar chúinsí eile

source: You may also be eligible for a Medical Card or GP visit card, depending on your circumstances
ga: Is féidir go mbeidh tú incháilithe freisin le haghaidh Cárta Leighis nó Cárta Cuairte ar Dhochtúir Ginearálta, ag brath ar do chuid cúinsí

source: The medical conditions that qualify under the Long Term Illness Scheme are:
ga: I measc na galair seo tá:

source: • Mental illness (for people under 16 only)
ga: • Tinneas intinne (do dhaoine faoi 16 d'aois amháin)

source: • Conditions arising from use of Thalidomide
ga: • Reachta de thoradh Tailídimíde

source: If you qualify, you will get a long-term illness book
ga: Má tá tú i dteideal na scéime, éisíotar duit leabhar tinneas fadtéarmach

source: This book lists the drugs and medicines for the treatment of your condition, which will be provided to you free of charge through your pharmacist
ga: Bíonn liosta sa leabhar seo de na drugaí agus leigheasanna a theastaíonn chun cóir leighis a chur orthu, agus cuirfear iad seo ar fáil dóibh saor in aisce tríd an bpoitigéir áitiúil

source: You do not have to pay a prescription charge for drugs covered by your long-term illness book
ga: Ní gá duit táille oidis a íoc i gcás drugaí atá clúdaithe ag do leabhar tinnis fhadtéarmaigh

source: Other drugs and medicines not related to the specified condition must be paid for in the normal way
ga: Ní mór duit íoc na drugaí agus leigheasanna nach bhfuil bainteach leis an riocht sonraithe

source: If your doctor or occupational therapist prescribes a medical or surgical appliance, it will be supplied to you from your Local Health Office
ga: Má scríobhann do dhochtúir nó do theiripeoir saothair oideas um fhearas leighis nó máinliachta, soláthrófar duitse é ó d’Oifig Sláinte Áitiúil

source: Non-medical card holders, non-GP visit card holders and conditions not covered under Long Term Illness
ga: Neamhshealbhóirí chárta leighis, neamhshealbhóirí chárta cuairte dochtúra agus ríochtaí leighis nach gcumhdaítear faoin Tinneas Fadtéarmach

source: If you have neither a medical card, nor a GP visit card nor a medical condition listed above, you can use the Drugs Payment Scheme to limit your expenses on prescription drugs
ga: Mura bhfuil cárta leighis ná cárta cuairte dochtúra ná riocht leighis a liostaítear thuas agat, féadann tú leas a bhaint as Scéim na nÍocaíochtaí Drugaí

source: You can get an application form from your Local Health Office or download an application form (pdf) and return it to your Local Health Office
ga: Is féidir an fhoirm a fháil ó d'Oifig Sláinte Áitiúil nó íoslódáil foirm iarratais (pdf) agus seol ar ais í chuig an Oifig Sláinte is gaire duit
